{
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen3-14B",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_v_bound": 0.02,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": [
    "score",
    "classifier",
    "score"
  ],
  "peft_type": "TINYLORA",
  "peft_version": "0.19.1",
  "projection_seed": 42,
  "r": 2,
  "revision": null,
  "save_projection": true,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": "SEQ_CLS",
  "tinylora_dropout": 0.0,
  "u": 16,
  "weight_tying": 0.0
}